Revit 2027 API
ParameterTypeId.FabricationServiceName Property
 "Fabrication Service Name"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricationServiceName { get; }
Public Shared ReadOnly Property FabricationServiceName As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricationServiceName {
	ForgeTypeId^ get ();
}
static member FabricationServiceName : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace